{
  "personal": {
    "name": "Anish Basety",
    "title": "Software Engineer",
    "email": "anishbasety@gmail.com",
    "phone": "+1 (630) 649-9797",
    "github": "https://github.com/anisety",
    "linkedin": "https://www.linkedin.com/in/anish-basety/",
    "website": "https://anisety.github.io/personalwebsite/",
    "location": "Champaign, IL",
    "avatar": "https://via.placeholder.com/400x400/6366f1/ffffff?text=AB",
    "summary": "Passionate software engineer with expertise in full-stack development, AI/ML, and creating innovative solutions. Currently pursuing Computer Science & Mathematics at UIUC with a focus on scalable systems and emerging technologies."
  },
  "experience": [
    {
      "position": "Artificial Intelligence Researcher",
      "company": "Algoverse",
      "location": "Remote",
      "startDate": "June 2025",
      "endDate": "Present",
      "description": "Conducting advanced research in artificial intelligence, focusing on novel algorithms and machine learning applications.",
      "achievements": [
        "Developed and optimized AI models for natural language processing tasks, achieving state-of-the-art results",
        "Published research papers on innovative AI techniques in leading conferences",
        "Collaborated with cross-functional teams to integrate AI solutions into real-world products",
        "Mentored junior researchers on AI methodologies and best practices"
      ],
      "technologies": ["Python", "TensorFlow", "PyTorch", "NLP", "Generative AI", "Deep Learning"]
    },
    {
      "position": "AI/ML Developer and Evaluator",
      "company": "Outlier",
      "location": "Remote",
      "startDate": "November 2024",
      "endDate": "Present",
      "description": "Developing and evaluating AI/ML models for various applications, with a focus on large language models and API testing.",
      "achievements": [
        "Developed robust API testing frameworks for AI models, ensuring high reliability and performance",
        "Evaluated and fine-tuned large language models (LLM) for specific use cases, improving accuracy by 15%",
        "Implemented machine learning algorithms using Swift and XML for mobile and web applications",
        "Contributed to the design and implementation of neural networks for complex data analysis"
      ],
      "technologies": ["Large Language Models (LLM)", "Machine Learning", "API Testing", "Swift (Programming Language)", "XML", "Artificial Intelligence (AI)", "Neural Networks", "Python"]
    },
    {
      "position": "Software Engineer",
      "company": "TED Conferences",
      "location": "New York, United States · Hybrid",
      "startDate": "May 2025",
      "endDate": "August 2025",
      "description": "Engineered backend systems for managing speaker metadata and talk content, and refactored legacy code for improved maintainability.",
      "achievements": [
        "Built Django-based backend endpoints to manage speaker metadata, talk transcripts, and tag relationships, enabling structured content retrieval and streamlining editorial workflows.",
        "Wrote custom PostgreSQL queries and schema migrations to normalize talk data, enforce referential integrity, and support advanced filtering logic for the TED.com content API.",
        "Refactored legacy code into modular services with unit tests and CI linting pipelines, improving maintainability and deployment reliability across TED’s web and mobile platforms."
      ],
      "technologies": ["Django", "Python", "PostgreSQL", "REST API", "Unit Testing", "CI/CD"]
    },
    {
      "position": "Undergraduate Research Assistant",
      "company": "UW-Madison Grainger Institute for Engineering",
      "location": "Remote",
      "startDate": "May 2025",
      "endDate": "August 2025",
      "description": "Conducted quantitative research on socio-economic factors and happiness rankings, utilizing advanced statistical methods.",
      "achievements": [
        "Performed multivariate OLS and log-linear regressions in Stata and R to quantify the marginal impact of GDP per capita on happiness rankings using 2019 World Happiness Report data.",
        "Conducted Breusch-Pagan and White tests for heteroskedasticity, corrected for non-constant variance using robust standard errors, and evaluated model fit through adjusted R² and residual diagnostics.",
        "Engineered reproducible scripts and automated cleaning pipelines to standardize country-level economic and well-being data, ensuring consistent input formats and minimizing manual preprocessing."
      ],
      "technologies": ["Stata", "R", "Econometrics", "Statistical Analysis", "Data Cleaning", "Regression Analysis"]
    },
    {
      "position": "Software Engineer Intern",
      "company": "Bumpups",
      "location": "Remote",
      "startDate": "January 2025",
      "endDate": "April 2025",
      "description": "Developed real-time video annotation components and optimized API performance for a video analysis platform.",
      "achievements": [
        "Developed frame-synchronized video annotation components in React and TypeScript, enabling users to interact with AI-generated insights overlaid on video timelines in real time.",
        "Implemented custom WebSocket hooks to deliver low-latency event updates (e.g., AI detection flags, timestamped cues) and improved user responsiveness during live video analysis.",
        "Optimized REST API calls for frame metadata and user interaction logs using dynamic pagination and conditional caching strategies, reducing redundant network requests by over 30%."
      ],
      "technologies": ["React", "TypeScript", "WebSocket", "REST API", "Video Processing", "Performance Optimization"]
    },
    {
      "position": "Undergraduate Student Researcher",
      "company": "UW-Madison Computer Sciences",
      "location": "On-site",
      "startDate": "October 2024",
      "endDate": "April 2025",
      "description": "Engaged in computer science research projects, contributing to algorithm development and data analysis.",
      "achievements": [
        "Assisted in the development of novel algorithms for data processing and analysis.",
        "Conducted experiments and analyzed results to validate research hypotheses.",
        "Contributed to research publications and presentations.",
        "Enhanced data visualization tools for complex datasets."
      ],
      "technologies": ["Python", "Data Structures", "Algorithms", "Research Methodology", "Data Visualization"]
    },
    {
      "position": "Research Assistant",
      "company": "Accenture",
      "location": "Chicago, Illinois, United States · On-site",
      "startDate": "June 2023",
      "endDate": "August 2023",
      "description": "Contributed to emerging product development and usability testing, focusing on enhancing user experience through data analysis.",
      "achievements": [
        "Collaborated with the engineering team to troubleshoot and debug technology-related challenges, enhancing system performance by 10%",
        "Conducted comprehensive usability testing on emerging products, including metaverse technologies, utilizing A/B testing methodologies.",
        "Improved user experience and satisfaction metrics by 15% through detailed analytics and feedback analysis.",
        "Assisted in developing user-centric design strategies, focusing on wireframes and user journey mapping.",
        "Analyzed user data with software analytics tools to identify trends and inform product enhancements.",
        "Documented technical findings and methodologies, contributing to team knowledge-sharing and best practices."
      ],
      "technologies": ["User-centered Design", "Innovation Research", "Product Analytics", "Cross-Functional Team Management", "Research and Development (R&D)", "R", "A/B Testing", "UX/UI"]
    },
    {
      "position": "Chapter Director",
      "company": "Tug Of Words Debate Club",
      "location": "Naperville, Illinois, United States",
      "startDate": "April 2020",
      "endDate": "August 2023",
      "description": "Directed chapter operations, fostering public speaking and debate skills among members.",
      "achievements": [
        "Managed chapter activities and organized debate events for over 50 members.",
        "Improved public speaking and critical thinking skills of members through structured training programs.",
        "Increased club membership by 20% through targeted outreach and engagement strategies.",
        "Secured funding and resources for club activities and competitions."
      ],
      "technologies": ["Leadership", "Public Speaking", "Event Management", "Team Building", "Mentorship"]
    },
    {
      "position": "Chief Operations Officer",
      "company": "Youth Climate Action Team Inc.",
      "location": "Washington, District of Columbia, United States · Remote",
      "startDate": "September 2020",
      "endDate": "September 2022",
      "description": "Oversaw organizational operations, strategic planning, and program execution for a non-profit environmental advocacy group.",
      "achievements": [
        "Streamlined operational workflows, improving organizational efficiency by 25%.",
        "Managed a team of volunteers and coordinated multiple environmental projects.",
        "Developed and implemented strategic plans to achieve organizational goals.",
        "Successfully managed budgets and resources for various initiatives.",
        "Expanded outreach programs, increasing community engagement by 30%."
      ],
      "technologies": ["Operations Management", "Strategic Planning", "Project Management", "Team Leadership", "Non-profit Management", "Environmental Advocacy"]
    }
  ],
  "projects": [
    {
      "title": "EcoScan",
      "description": "AI-powered mobile application for recyclable classification and disposal guidance with gamification features. EcoScan is a web application that helps users recycle more effectively. Simply upload an image of an item, and EcoScan will identify the object and provide you with instructions on how to recycle it properly.",
      "role": "Full-Stack Developer",
      "category": "Hackathon",
      "startDate": "November 2024",
      "endDate": "November 2024",
      "achievements": [
        "Achieved 95% accuracy in recyclable classification using computer vision",
        "Served 200+ active users with 1,000+ daily transactions",
        "Implemented gamification system increasing user engagement by 60%",
        "Built SQL backend handling complex queries and data analytics",
        "Developed an intuitive web interface for image upload and information display"
      ],
      "technologies": ["Flask", "HTML/CSS", "JavaScript", "Python", "OpenAI API", "GPT-4 Turbo Mini", "SQL", "Computer Vision"],
      "github": "https://github.com/anisety/EcoScan",
      "demo": "https://ecoscan-demo.vercel.app",
      "image": "https://via.placeholder.com/400x250/3B82F6/FFFFFF?text=EcoScan"
    },
    {
      "title": "AlgoverseResearch",
      "description": "This project is a replication of a study on Uncertainty Estimation using Kullback-Leibler (KL) Divergence in machine learning models.",
      "role": "Researcher",
      "category": "Research",
      "startDate": "June 2025",
      "endDate": "Present",
      "achievements": [
        "Replicated a study on Uncertainty Estimation using Kullback-Leibler (KL) Divergence in machine learning models.",
        "Analyzed and interpreted complex machine learning model uncertainties.",
        "Contributed to understanding and improving model reliability."
      ],
      "technologies": ["Python", "Machine Learning", "Kullback-Leibler Divergence", "Uncertainty Estimation", "Data Analysis"],
      "github": "https://github.com/anisety/AlgoverseResearch",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/FF5733/FFFFFF?text=AlgoverseResearch"
    },
    {
      "title": "pulse",
      "description": "Pulse is a web application designed to provide real-time data visualization and analysis. It features a React-based frontend that communicates with a powerful Python backend capable of performing complex data processing, including Natural Language Processing (NLP) tasks.",
      "role": "Full-Stack Developer",
      "category": "Web",
      "startDate": "September 2024",
      "endDate": "Present",
      "achievements": [
        "Developed a React-based frontend for real-time data visualization.",
        "Implemented a Python backend for complex data processing and Natural Language Processing (NLP) tasks.",
        "Designed and integrated real-time data streaming capabilities for dynamic insights.",
        "Enhanced user experience through intuitive data presentation and interactive controls."
      ],
      "technologies": ["JavaScript", "React", "Python", "FastAPI", "NLP", "Data Visualization", "WebSockets"],
      "github": "https://github.com/anisety/pulse",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/007BFF/FFFFFF?text=Pulse"
    },
    {
      "title": "Cognate",
      "description": "An AI-powered, personalized learning ecosystem for adaptive study, career coaching, neurodiverse optimization, and global peer-learning.",
      "role": "AI Architect",
      "category": "AI/Education",
      "startDate": "August 2024",
      "endDate": "Present",
      "achievements": [
        "Designed and implemented an AI-powered personalized learning ecosystem.",
        "Developed adaptive study modules and career coaching functionalities.",
        "Optimized learning paths for neurodiverse users.",
        "Facilitated global peer-learning interactions through integrated features."
      ],
      "technologies": ["Python", "Artificial Intelligence", "Machine Learning", "Adaptive Learning", "Educational Technology", "Personalization"],
      "github": "https://github.com/anisety/Cognate",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/6C757D/FFFFFF?text=Cognate"
    },
    {
      "title": "AISwimCoach",
      "description": "AI Swim Coach is a mobile application that uses artificial intelligence to analyze your swimming technique and provide personalized feedback to help you improve. Flutter-based tool for AI-driven swimming analysis and technique improvement.",
      "role": "Developer",
      "category": "Mobile",
      "startDate": "March 2024",
      "endDate": "June 2024",
      "achievements": [
        "Built cross-platform mobile application using Flutter",
        "Integrated AI models for real-time swimming analysis",
        "Implemented user progress tracking and analytics dashboard",
        "Provided personalized feedback to improve swimming technique"
      ],
      "technologies": ["Dart", "Flutter", "TensorFlow Lite", "Firebase", "AI/ML"],
      "github": "https://github.com/anisety/AISwimCoach",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/8B5CF6/FFFFFF?text=AISwimCoach"
    },
    {
      "title": "dine-nearby-explorer",
      "description": "This project is a web application that helps users find restaurants nearby. It is built with Vite, React, TypeScript, and Shadcn UI. Explorer application for discovering and reviewing nearby restaurants.",
      "role": "Developer",
      "category": "Web",
      "startDate": "January 2024",
      "endDate": "March 2024",
      "achievements": [
        "Built location-based restaurant discovery system",
        "Integrated third-party APIs for restaurant data and reviews",
        "Implemented user rating and review system",
        "Utilized modern frontend technologies (Vite, React, TypeScript, Shadcn UI) for a responsive and engaging user experience"
      ],
      "technologies": ["TypeScript", "React", "Node.js", "MongoDB", "Google Maps API", "Vite", "Shadcn UI"],
      "github": "https://github.com/anisety/dine-nearby-explorer",
      "demo": "https://dine-nearby.vercel.app",
      "image": "https://via.placeholder.com/400x250/EF4444/FFFFFF?text=Dine+Nearby"
    },
    {
      "title": "CarbonMarketTycoon",
      "description": "A Unity & C# simulation game about climate economics, sustainability, and corporate decision-making.",
      "role": "Game Developer",
      "category": "Game Development",
      "startDate": "October 2024",
      "endDate": "Present",
      "achievements": [
        "Developed a simulation game in Unity exploring climate economics and sustainability.",
        "Implemented complex corporate decision-making mechanics and economic models.",
        "Designed engaging gameplay scenarios related to environmental impact and resource management.",
        "Utilized C# for game logic and interaction scripting."
      ],
      "technologies": ["C#", "Unity", "Game Development", "Simulation", "Economics", "Sustainability"],
      "github": "https://github.com/anisety/CarbonMarketTycoon",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/28A745/FFFFFF?text=CarbonMarketTycoon"
    },
    {
      "title": "SafeLens",
      "description": "AI-powered content safety, harmful content filtering, and compliance monitoring. This repository contains the source code for SafeLens, a platform for real-time content moderation using AI. It includes a Python backend powered by FastAPI and a pre-trained NLP model, along with a modern React frontend.",
      "role": "Full-Stack AI Developer",
      "category": "AI/Web",
      "startDate": "July 2024",
      "endDate": "Present",
      "achievements": [
        "Developed an AI-powered platform for real-time content moderation and harmful content filtering.",
        "Implemented a Python backend with FastAPI and a pre-trained NLP model for robust content analysis.",
        "Built a modern React frontend for intuitive compliance monitoring and user interaction.",
        "Ensured content safety and regulatory compliance through advanced AI techniques."
      ],
      "technologies": ["Python", "FastAPI", "NLP", "React", "JavaScript", "Artificial Intelligence", "Content Moderation"],
      "github": "https://github.com/anisety/SafeLens",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/DC3545/FFFFFF?text=SafeLens"
    },
    {
      "title": "manuvo",
      "description": "Real-time ASL recognition, gesture interpretation, and accessibility intelligence. Manuvo is a modular AI-powered platform that recognizes American Sign Language (ASL) in real-time, provides feedback for learners, and enables accessible communication across personal, educational, and emergency contexts. Its core engine is built for image recognition, AWS Lambda serverless processing, responsive web/mobile layouts, mobile/iOS support, and real-time feedback, with extensions for creative spin-off applications.",
      "role": "AI/Mobile Developer",
      "category": "AI/Accessibility",
      "startDate": "May 2024",
      "endDate": "Present",
      "achievements": [
        "Developed a modular AI platform for real-time American Sign Language (ASL) recognition.",
        "Implemented gesture interpretation and provided real-time feedback for learners.",
        "Designed for responsive web/mobile layouts with iOS support and AWS Lambda serverless processing.",
        "Enabled accessible communication across personal, educational, and emergency contexts."
      ],
      "technologies": ["Python", "Artificial Intelligence", "Image Recognition", "AWS Lambda", "Mobile Development", "Accessibility", "ASL"],
      "github": "https://github.com/anisety/manuvo",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/6610F2/FFFFFF?text=Manuvo"
    },
    {
      "title": "RePackr",
      "description": "Packaging and optimization system for efficient resource management.",
      "role": "Developer",
      "category": "Web",
      "startDate": "September 2024",
      "endDate": "December 2024",
      "achievements": [
        "Developed Java-based backend with TypeScript frontend",
        "Implemented optimization algorithms for resource allocation",
        "Built comprehensive testing suite with 90% code coverage"
      ],
      "technologies": ["Java", "TypeScript", "Spring Boot", "React", "PostgreSQL"],
      "github": "https://github.com/anisety/repackr",
      "demo": "https://repackr-demo.vercel.app",
      "image": "https://via.placeholder.com/400x250/F59E0B/FFFFFF?text=RePackr"
    },
    {
      "title": "RePackr-dev",
      "description": "Welcome to AI Moving Helper, your intelligent assistant for managing every aspect of a residential move — from packing to internet transfer, address updates, and furniture fitting. This tool empowers users to efficiently plan their move while maintaining visibility over key steps and logistics.",
      "role": "Developer",
      "category": "Web/AI",
      "startDate": "July 2024",
      "endDate": "Present",
      "achievements": [
        "Developed an intelligent assistant to manage residential moves, including packing, internet transfer, and address updates.",
        "Empowered users to efficiently plan and maintain visibility over key logistics steps.",
        "Implemented AI-driven features to streamline the moving process.",
        "Designed a user-friendly interface for comprehensive move management."
      ],
      "technologies": ["TypeScript", "React", "Node.js", "AI", "Logistics", "Project Management"],
      "github": "https://github.com/anisety/RePackr-dev",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/FD7E14/FFFFFF?text=RePackr-dev"
    },
    {
      "title": "sw-challenge-spring-2025",
      "description": "Trading challenge repository for algorithmic trading and financial analysis.",
      "role": "Developer",
      "category": "Academic",
      "startDate": "January 2025",
      "endDate": "Present",
      "achievements": [
        "Forked and customized trading challenge framework",
        "Implemented algorithmic trading strategies",
        "Built backtesting and performance analysis tools"
      ],
      "technologies": ["Python", "Pandas", "NumPy", "Matplotlib", "Jupyter"],
      "github": "https://github.com/anisety/sw-challenge-spring-2025",
      "demo": null,
      "image": "https://via.placeholder.com/400x250/84CC16/FFFFFF?text=Trading+Challenge"
    },
    {
      "title": "Virtual Swimming Coach Tool",
      "description": "Mobile application for AI-driven swimming stroke analysis and personalized training plans.",
      "role": "Lead Developer",
      "category": "Mobile",
      "startDate": "February 2024",
      "endDate": "July 2024",
      "achievements": [
        "Improved swim efficiency by 20% through real-time stroke analysis",
        "Built mobile app serving 500+ active users with 30% higher retention",
        "Developed AI-driven training plans personalized to individual performance",
        "Implemented SQL database managing 10,000+ training sessions"
      ],
      "technologies": ["Python", "JavaScript", "Flutter", "SQL", "PHP", "OpenAI API"],
      "github": "https://github.com/anishbasety/swimming-coach",
      "demo": "https://swimming-coach-demo.vercel.app",
      "image": "https://via.placeholder.com/400x250/10B981/FFFFFF?text=Swimming+Coach"
    },
    {
      "title": "Personal Website",
      "description": "Modern, responsive personal portfolio website built with React and TypeScript.",
      "role": "Developer",
      "category": "Web",
      "startDate": "January 2025",
      "endDate": "January 2025",
      "achievements": [
        "Built responsive design with 95+ Lighthouse performance score",
        "Implemented smooth animations and modern UI/UX",
        "Integrated SEO optimization and accessibility features"
      ],
      "technologies": ["React", "TypeScript", "TailwindCSS", "Framer Motion", "Vite"],
      "github": "https://github.com/anisety/personalwebsite",
      "demo": "https://anishbasety.com",
      "image": "https://via.placeholder.com/400x250/06B6D4/FFFFFF?text=Personal+Website"
    }
  ],
  "skills": {
    "languages": [
      { "name": "JavaScript", "proficiency": 95 },
      { "name": "TypeScript", "proficiency": 90 },
      { "name": "Python", "proficiency": 88 },
      { "name": "Java", "proficiency": 85 },
      { "name": "Dart", "proficiency": 80 },
      { "name": "SQL", "proficiency": 85 },
      { "name": "HTML/CSS", "proficiency": 90 }
    ],
    "frameworks": [
      { "name": "React", "proficiency": 92 },
      { "name": "Node.js", "proficiency": 88 },
      { "name": "Flutter", "proficiency": 85 },
      { "name": "Spring Boot", "proficiency": 80 },
      { "name": "FastAPI", "proficiency": 85 },
      { "name": "Express.js", "proficiency": 90 }
    ],
    "developerTools": [
      { "name": "Git", "proficiency": 95 },
      { "name": "Docker", "proficiency": 80 },
      { "name": "AWS", "proficiency": 75 },
      { "name": "Jenkins", "proficiency": 70 },
      { "name": "Kubernetes", "proficiency": 65 },
      { "name": "VS Code", "proficiency": 95 }
    ],
    "librariesTools": [
      { "name": "TensorFlow", "proficiency": 80 },
      { "name": "PyTorch", "proficiency": 75 },
      { "name": "OpenAI API", "proficiency": 85 },
      { "name": "MongoDB", "proficiency": 80 },
      { "name": "PostgreSQL", "proficiency": 85 },
      { "name": "Redis", "proficiency": 75 }
    ]
  },
  "education": {
    "university": "University of Illinois Urbana-Champaign",
    "degree": "B.S. Computer Science & Mathematics",
    "graduationDate": "May 2027",
    "gpa": "4.0/4.0",
    "relevantCoursework": [
      "Data Structures and Algorithms",
      "Computer Architecture",
      "Linear Algebra",
      "Statistical Economics",
      "Machine Learning",
      "Database Systems",
      "Software Engineering"
    ]
  },
  "awards": [
    {
      "title": "Dean's List",
      "organization": "University of Wisconsin-Madison",
      "date": "Fall 2024, Spring 2025",
      "description": "Academic excellence recognition for maintaining high GPA"
    },
    {
      "title": "Hackathon Winner",
      "organization": "EcoScan Project",
      "date": "November 2024",
      "description": "First place for innovative AI-powered recycling solution"
    },
    {
      "title": "Outstanding Intern Award",
      "organization": "Bumpups",
      "date": "April 2025",
      "description": "Recognition for exceptional performance and contributions"
    }
  ],
  "stats": {
    "yearsExperience": 3,
    "projectsCompleted": 15,
    "openSourceContributions": 25,
    "hackathonsWon": 3
  }
}
